app/views/events/_form.html.erb


      <% Location.all.each do |location| %>
        <% if ! @event.locations.include? location %>
---
SELECT "locations".* FROM "locations"
SELECT  1 AS one FROM "locations" INNER JOIN "events_locations" ON "locations"."id" = "events_locations"."location_id" WHERE "events_locations"."event_id" = ? AND "locations"."id" = 1 LIMIT 1  [["event_id", 1]]


      <% Participant.all.each do |participant| %>
        <% if ! @event.participants.include? participant %>
---
SELECT "participants".* FROM "participants"
SELECT  1 AS one FROM "participants" INNER JOIN "events_participants" ON "participants"."id" = "events_participants"."participant_id" WHERE "events_participants"."event_id" = ? AND "participants"."id" = 1 LIMIT 1  [["event_id", 2]]