app/views/events/show.html.erb

SELECT "locations".* FROM "locations" INNER JOIN "events_locations" ON "locations"."id" = "events_locations"."location_id" WHERE "events_locations"."event_id" = ?  [["event_id", 1]]
---

  <% @event.locations.each do |location| %>

SELECT "participants".* FROM "participants" INNER JOIN "events_participants" ON "participants"."id" = "events_participants"."participant_id" WHERE "events_participants"."event_id" = ?  [["event_id", 1]]
---

  <% @event.participants.each do |participant| %>