app/controllers/events_controller.rb

SELECT  "participants".* FROM "participants"  WHERE "participants"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 19]]
UPDATE "events" SET "name" = ?, "updated_at" = ? WHERE "events"."id" = 7  [["name", "Event 15"], ["updated_at", "2015-04-08 22:09:30.826493"]]
---
  def update

    Participant.find(params["add_participants"]).each do |participant|
          @event.participants << participant
      end
    Location.find(params["add_locations"]).each do |location|
          @event.locations << location
      end

      respond_to do |format|

      if @event.update(event_params)